
[
	// Kurai Sekai ( Rumia )
	{
		"name": "Kurai Sekai",
		"leaderName": "Rumia",
		"adjective": ["Youkai"],
		"preferredVictoryType": "Domination",

		"startIntroPart1": "This mod is still partly finished.",
		"startIntroPart2": "I wish you enjoy it!",
		"declaringWar": "So-na-no-ka, ne?",
		"attacked": "Sonanoka.",
		"defeated": "Sonanoka...",
		"introduction": "Sonanoka!",
		"neutralHello": "Sonanoka~",
		"hateHello": "Sonanoka.",
		"tradeRequest": "Sonanoka?",
		"outerColor": [0,0,0],
		"innerColor": [255,255,255],
		"uniqueName": "Man-Eating Youkai Race",
		"uniques": ["[Land] units gain the [Man-Eating Youkai] promotion", "Starts with [Honor] adopted", "[-10]% Production when constructing [{Military} {Land}] units [in all cities]", "[20]% XP gained from combat <for [Land] units>", "[+1 Science] [in capital]", "Earn [20]% of the damage done to [Land] units as [Gold]"],
		"cities": ["Hōreisou"]
	},

	// Ningen-no-Sato-Touhou ( Kamishirasawa Keine )
	{
		"name": "Ningen no Sato",
		"leaderName": "Keine Kamashirasawa",
		"adjective": ["Ningen no Sato"],
		"startBias": ["Grassland", "River"],
		"startIntroPart1": "Greetings to you, Keine Kamashirasawa, protector and guardian of the Ningen no Sato. 
							Ningen no Sato is the name for the largest human community within Gensokyo. Commonly referred to as 'the human village' by the other inhabitants of Gensokyo, it remains the safest place for humans in that land.",
		"startIntroPart2": "One of the reasons for that sense of security is that the Ningen no Sato is protected by Keine Kamishirasawa, a were-hakutaku. She possesses the ability to conceal the history -- and thus existence -- of things, and has at times used this ability to safeguard the village from harm. Under the light of a full moon, she transforms into her hakutaku form, which allows her to create, rather than conceal things. She also serves the community as a schoolteacher.
							Knowledgeable and protective Keine, will you guard the people of the Ningen no Sato as they seek to expand and grow? Can you create a civilization that will stand the test of time?",
		"declaringWar": "I'm afraid you have become a threat to the people under my protection.",
		"attacked": "I will protect the people of this community with all of my strength.",
		"defeated": "It seems that I will have to become stronger in order to fulfill my obligations. Perhaps, in time, we will meet again.",
		"introduction": "Ahh, a newcomer to the Ningen no Sato?  Please make yourself comfortable, I am Keine Kamashirasawa.",
		"neutralHello": "Oh, hello!  Welcome to the Ningen no Sato.",
		"hateHello": "If you stop by the school some time, I shall prepare tea for us",
		"tradeRequest": "My people need something of you, can we trade it?.",
		"outerColor": [193,167,140],
		"innerColor": [94,124, 10],
		"uniqueName": "Agrarian Society",
		"uniques" : ["[+1 Food] from every [Pasture]", "[+1 Gold] from every [Plantation]"],
		"cities": ["Hitozato", "Minamiyamashiro", "Chibu", "Sanagouchi", "Kitayama", "Hiezu", "Kiyokawa", "Ouhira", "Himeshima",
					"Higashichichibu", "Funahashi", "Chihayakasawa", "Kutsuki", "Hinamizawa"]
	},

	// The Scarlet Estate ( Remilia Scarlet )
	{
		"name": "The Scarlet Estate",
		"leaderName": "Remilia Scarlet",
		"adjective": ["The Scarlet Estate"],
		"startBias": ["Grassland", "Lakes"],
		"startIntroPart1": "Greetings, lady Remilia Scarlet, the Eternally Young Scarlet Moon, the mistress of the Scarlet Devil Mansion. Your subordinates bow to your immortal rule, and no visitor is left unswayed by your undying charisma. 
							Located at the edge of Misty Lake, it stands as a monument to Gensokyo's many mysteries. From the clock tower to the magical library, every visitor has been awestruck by its magnificent - and should I add, well maintained - splendor. Its many powerful and loyal inhabitants have always ensured the mansion's success, and under the rule of the Lady herself, will never fail in doing so.
							Oh Scarlet Moon, will you continue the prosperous grandeur of your estate? Or will you spread the mists to the world's furthest reaches, and unite all beings under the scarlet banner? Can you build a civilization that will stand the test of time?",
		"startIntroPart2": "The Scarlet Estate, located at the edge of Misty Lake, has been around for an unknown amount of time. Its eye-catching feature is the clock tower rising up from the red rooftops. 
							Surrounding the mansion stands a brick wall, its gate being protected by the somewhat lazy yet loyal Hong Meiling. Inside the mansion you'll find the magic Library and its librarian Patchouli Knowledge, and the many corridors whose cleanliness is under the constant supervision of the Chief Maid Sakuya Izayoi. Underneath it all you'll find the mansion's little secret, Remilia's sister Flandre. You don't want to meet Flandre.",
		"declaringWar": "My staff will be there in a moment to claim what's mine. Any resistance will be dealt with.",
		"attacked": "Looks like it's going to be a fun night.",
		"defeated": "Just go away already.",
		"introduction": "Welcome to the mansion, stranger, my name is Remilia Scarlet. Cup of tea?",
		"neutralHello": "Hello there. Make yourself at home. Ask the maid if you need anything.",
		"hateHello": "So, what are you here for?",
		"tradeRequest": "Say, what do you think of this?",
		"outerColor": [145, 40,  0],
		"innerColor": [ 10, 10, 10],
		"uniqueName": "Scarlet Mist",
		"uniques" : [
			"[-25]% Culture cost of natural border growth [in all cities]", 
			"New [Military] units start with [15] Experience [in all cities]", 
			"[-25]% construction time for [All] improvements"
		],
		"cities": ["Scarlet Mansion", "Amaranth", "Gungnir", "Carnelian", "Voile", "Misty Lake", "Piros", "Sarkans", "Lavatein", "Antares",
					"Cranberry Acres", "Alizarin", "Cardinal", "New Bucharest", "Crimson", "Sanguine", "Betelgeuze", "Maroon", "Vörös", "Arcturus",
					"Kermes", "Carmine", "Cerise", "Aldebaran", "Scharlaken"]
	},

	// Fairy Alliance ( Cirno )
	{
		"name": "Fairy Alliance",
		"leaderName": "Cirno",
		"adjective": ["Fairy Alliance"],
		"startBias": ["Avoid [Desert]"],
		"startIntroPart1": "All hail Cirno! All hail the strongest and smartest of the fairies! It's high time fairies got some respect around here, and as the strongest fairy, you're just the one to see it happen! Will the youkai cower in fear at your armies that never stay dead, or will the humans ooh and aah at the beauty of your ice sculptures and nature art? To build a civilization that will stand the test of time, everything is 1, 2, 9!",
		"startIntroPart2": "The Alliance is led by Cirno, the self-proclaimed strongest fairy, but not alone: she often gets assistance from her fairy or non-fairy friends. With assistance from her friends, the Great Fairy Alliance hopes to bring respect to fairies, bugs, small birds, and whatever-Rumia-ises. And really: if someone else conquers most of the planet, or launches a mission to the Moon, or creates a culture that will define the arc of history, and the fairies don't because they were spending too much time having fun...aren't they the real winners?",
		"declaringWar": "I challenge your civilization to danmaku battle! Fairies will fill the sky with bullets!.",
		"attacked": "If it's a fight you want, I'll be happy to oblige!",
		"defeated": "Okay, okay, uncle, uncle!",
		"introduction": "Ah-ha! I told you guys there was a weirdo around here! Hello, weirdo. I'm Cirno!.",
		"neutralHello": "Oh, hello there.",
		"hateHello": "You again? Shouldn't you have fallen in a hole by now?",
		"tradeRequest": "I kinda froze some of our supplies and I need replacements before Daiyousei finds out.",
		"outerColor": [82,122,191],
		"innerColor": [255,255,255],
		"uniqueName": "Great Fairy Wars",
		"uniqueText": " +100% Production when constructing unit but unit maintenance costs is higher 75%.",
		"uniques" : [
			"[+100]% Production when constructing [All] units [in all cities]", 
			"[+75]% maintenance costs <for [All] units>"
		],
		"cities": ["Cirnopolis", "Daiyouseiville", "Sunnydale", "Lunaberg", "Star City", "White Rock", "Wrigglington", "Lily Whitefield", "Mystia Crossing",
			"Rumia Town", "Autumn Falls", "Summer Meadows", "Spring Forest", "Winter Mountain", "Chen Valley", "Drizzle Cove", "Cirrus", "Blustery Village",
			"Misty Lake", "Petal Grove", "Syracuse"]
	},
]
